zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32-pinctrl.h
/*
 * Copyright (c) 2026 Espressif Systems (Shanghai) Co., Ltd.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * NOTE: Autogenerated file using esp_genpinctrl.py
 */

/**
 * @file
 * @brief Devicetree pin control helpers for Espressif ESP32
 * @ingroup pinctrl_esp32
 */

#ifndef ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESP32_PINCTRL_H_
#define ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESP32_PINCTRL_H_

#include "esp-pinctrl-common.h"
#include "esp32-gpio-sigmap.h"

/**
 * @addtogroup espressif_pinctrl Espressif pin control helpers
 * @ingroup devicetree-pinctrl
 */

/**
 * @defgroup pinctrl_esp32 Espressif ESP32 pin control helpers
 * @brief Macros for pin control configuration of Espressif ESP32
 * @ingroup espressif_pinctrl
 *
 * The macros follow a naming convention: `<PERIPHERAL>_<SIGNAL>_GPIO<PIN>`.
 * For example, `I2C0_SCL_GPIO1` corresponds to the `SCL` signal of `I2C0`
 * mapped to `GPIO1`.
 *
 * @code{.dts}
 * #include <zephyr/dt-bindings/pinctrl/esp32-pinctrl.h>
 *
 * &pinctrl {
 *     uart0_default: uart0_default {
 *         group1 {
 *             pinmux = <UART0_TX_GPIO21>;
 *         };
 *         group2 {
 *             pinmux = <UART0_RX_GPIO20>;
 *             bias-pull-up;
 *         };
 *     };
 * };
 * @endcode
 *
 * @{
 */

/** @cond INTERNAL_HIDDEN */

/**
 * @name DAC_CH1
 * @{
 */
#define DAC_CH1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_DAC1_OUT)
/** @} */

/**
 * @name DAC_CH2
 * @{
 */
#define DAC_CH2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_DAC2_OUT)
/** @} */

/**
 * @name I2C0_SCL
 * @{
 */
#define I2C0_SCL_GPIO0 ESP32_PINMUX(0, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO1 ESP32_PINMUX(1, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO2 ESP32_PINMUX(2, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO3 ESP32_PINMUX(3, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO4 ESP32_PINMUX(4, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO5 ESP32_PINMUX(5, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO6 ESP32_PINMUX(6, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO7 ESP32_PINMUX(7, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO8 ESP32_PINMUX(8, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO9 ESP32_PINMUX(9, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO10 ESP32_PINMUX(10, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO11 ESP32_PINMUX(11, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO12 ESP32_PINMUX(12, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO13 ESP32_PINMUX(13, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO14 ESP32_PINMUX(14, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO15 ESP32_PINMUX(15, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO16 ESP32_PINMUX(16, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO17 ESP32_PINMUX(17, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO18 ESP32_PINMUX(18, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO19 ESP32_PINMUX(19, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO20 ESP32_PINMUX(20, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO21 ESP32_PINMUX(21, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO22 ESP32_PINMUX(22, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO23 ESP32_PINMUX(23, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO25 ESP32_PINMUX(25, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO26 ESP32_PINMUX(26, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO27 ESP32_PINMUX(27, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO32 ESP32_PINMUX(32, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
#define I2C0_SCL_GPIO33 ESP32_PINMUX(33, ESP_I2CEXT0_SCL_IN, ESP_I2CEXT0_SCL_OUT)
/** @} */

/**
 * @name I2C0_SDA
 * @{
 */
#define I2C0_SDA_GPIO0 ESP32_PINMUX(0, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO1 ESP32_PINMUX(1, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO2 ESP32_PINMUX(2, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO3 ESP32_PINMUX(3, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO4 ESP32_PINMUX(4, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO5 ESP32_PINMUX(5, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO6 ESP32_PINMUX(6, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO7 ESP32_PINMUX(7, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO8 ESP32_PINMUX(8, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO9 ESP32_PINMUX(9, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO10 ESP32_PINMUX(10, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO11 ESP32_PINMUX(11, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO12 ESP32_PINMUX(12, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO13 ESP32_PINMUX(13, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO14 ESP32_PINMUX(14, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO15 ESP32_PINMUX(15, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO16 ESP32_PINMUX(16, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO17 ESP32_PINMUX(17, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO18 ESP32_PINMUX(18, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO19 ESP32_PINMUX(19, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO20 ESP32_PINMUX(20, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO21 ESP32_PINMUX(21, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO22 ESP32_PINMUX(22, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO23 ESP32_PINMUX(23, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO25 ESP32_PINMUX(25, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO26 ESP32_PINMUX(26, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO27 ESP32_PINMUX(27, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO32 ESP32_PINMUX(32, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
#define I2C0_SDA_GPIO33 ESP32_PINMUX(33, ESP_I2CEXT0_SDA_IN, ESP_I2CEXT0_SDA_OUT)
/** @} */

/**
 * @name I2C1_SCL
 * @{
 */
#define I2C1_SCL_GPIO0 ESP32_PINMUX(0, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO1 ESP32_PINMUX(1, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO2 ESP32_PINMUX(2, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO3 ESP32_PINMUX(3, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO4 ESP32_PINMUX(4, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO5 ESP32_PINMUX(5, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO6 ESP32_PINMUX(6, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO7 ESP32_PINMUX(7, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO8 ESP32_PINMUX(8, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO9 ESP32_PINMUX(9, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO10 ESP32_PINMUX(10, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO11 ESP32_PINMUX(11, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO12 ESP32_PINMUX(12, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO13 ESP32_PINMUX(13, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO14 ESP32_PINMUX(14, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO15 ESP32_PINMUX(15, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO16 ESP32_PINMUX(16, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO17 ESP32_PINMUX(17, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO18 ESP32_PINMUX(18, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO19 ESP32_PINMUX(19, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO20 ESP32_PINMUX(20, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO21 ESP32_PINMUX(21, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO22 ESP32_PINMUX(22, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO23 ESP32_PINMUX(23, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO25 ESP32_PINMUX(25, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO26 ESP32_PINMUX(26, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO27 ESP32_PINMUX(27, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO32 ESP32_PINMUX(32, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
#define I2C1_SCL_GPIO33 ESP32_PINMUX(33, ESP_I2CEXT1_SCL_IN, ESP_I2CEXT1_SCL_OUT)
/** @} */

/**
 * @name I2C1_SDA
 * @{
 */
#define I2C1_SDA_GPIO0 ESP32_PINMUX(0, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO1 ESP32_PINMUX(1, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO2 ESP32_PINMUX(2, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO3 ESP32_PINMUX(3, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO4 ESP32_PINMUX(4, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO5 ESP32_PINMUX(5, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO6 ESP32_PINMUX(6, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO7 ESP32_PINMUX(7, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO8 ESP32_PINMUX(8, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO9 ESP32_PINMUX(9, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO10 ESP32_PINMUX(10, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO11 ESP32_PINMUX(11, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO12 ESP32_PINMUX(12, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO13 ESP32_PINMUX(13, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO14 ESP32_PINMUX(14, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO15 ESP32_PINMUX(15, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO16 ESP32_PINMUX(16, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO17 ESP32_PINMUX(17, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO18 ESP32_PINMUX(18, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO19 ESP32_PINMUX(19, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO20 ESP32_PINMUX(20, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO21 ESP32_PINMUX(21, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO22 ESP32_PINMUX(22, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO23 ESP32_PINMUX(23, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO25 ESP32_PINMUX(25, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO26 ESP32_PINMUX(26, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO27 ESP32_PINMUX(27, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO32 ESP32_PINMUX(32, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
#define I2C1_SDA_GPIO33 ESP32_PINMUX(33, ESP_I2CEXT1_SDA_IN, ESP_I2CEXT1_SDA_OUT)
/** @} */

/**
 * @name I2S0_I_BCK
 * @{
 */
#define I2S0_I_BCK_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
/** @} */

/**
 * @name I2S0_I_SD
 * @{
 */
#define I2S0_I_SD_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
#define I2S0_I_SD_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_DATA_IN15, ESP_NOSIG)
/** @} */

/**
 * @name I2S0_I_WS
 * @{
 */
#define I2S0_I_WS_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
#define I2S0_I_WS_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_WS_IN, ESP_I2S0I_WS_OUT)
/** @} */

/**
 * @name I2S0_O_BCK
 * @{
 */
#define I2S0_O_BCK_GPIO0 ESP32_PINMUX(0, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO1 ESP32_PINMUX(1, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO2 ESP32_PINMUX(2, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO3 ESP32_PINMUX(3, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO4 ESP32_PINMUX(4, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO5 ESP32_PINMUX(5, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO6 ESP32_PINMUX(6, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO7 ESP32_PINMUX(7, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO8 ESP32_PINMUX(8, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO9 ESP32_PINMUX(9, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO10 ESP32_PINMUX(10, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO11 ESP32_PINMUX(11, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO12 ESP32_PINMUX(12, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO13 ESP32_PINMUX(13, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO14 ESP32_PINMUX(14, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO15 ESP32_PINMUX(15, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO16 ESP32_PINMUX(16, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO17 ESP32_PINMUX(17, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO18 ESP32_PINMUX(18, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO19 ESP32_PINMUX(19, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO20 ESP32_PINMUX(20, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO21 ESP32_PINMUX(21, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO22 ESP32_PINMUX(22, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO23 ESP32_PINMUX(23, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO25 ESP32_PINMUX(25, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO26 ESP32_PINMUX(26, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO27 ESP32_PINMUX(27, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO32 ESP32_PINMUX(32, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO33 ESP32_PINMUX(33, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO34 ESP32_PINMUX(34, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO35 ESP32_PINMUX(35, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO36 ESP32_PINMUX(36, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO37 ESP32_PINMUX(37, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO38 ESP32_PINMUX(38, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
#define I2S0_O_BCK_GPIO39 ESP32_PINMUX(39, ESP_I2S0O_BCK_IN, ESP_I2S0O_BCK_OUT)
/** @} */

