zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32-pinctrl.h
/**
 * @name LEDC_CH1
 * @{
 */
#define LEDC_CH1_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
#define LEDC_CH1_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT1)
/** @} */

/**
 * @name LEDC_CH10
 * @{
 */
#define LEDC_CH10_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
#define LEDC_CH10_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT2)
/** @} */

/**
 * @name LEDC_CH11
 * @{
 */
#define LEDC_CH11_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
#define LEDC_CH11_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT3)
/** @} */

/**
 * @name LEDC_CH12
 * @{
 */
#define LEDC_CH12_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
#define LEDC_CH12_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT4)
/** @} */

/**
 * @name LEDC_CH13
 * @{
 */
#define LEDC_CH13_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
#define LEDC_CH13_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT5)
/** @} */

/**
 * @name LEDC_CH14
 * @{
 */
#define LEDC_CH14_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
#define LEDC_CH14_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT6)
/** @} */

/**
 * @name LEDC_CH15
 * @{
 */
#define LEDC_CH15_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
#define LEDC_CH15_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_HS_SIG_OUT7)
/** @} */

/**
 * @name LEDC_CH2
 * @{
 */
#define LEDC_CH2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
#define LEDC_CH2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT2)
/** @} */

/**
 * @name LEDC_CH3
 * @{
 */
#define LEDC_CH3_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
#define LEDC_CH3_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT3)
/** @} */

/**
 * @name LEDC_CH4
 * @{
 */
#define LEDC_CH4_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
#define LEDC_CH4_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT4)
/** @} */

