zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32-pinctrl.h
/**
 * @name PCNT5_CH0CTRL
 * @{
 */
#define PCNT5_CH0CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH0_IN5, ESP_NOSIG)
/** @} */

/**
 * @name PCNT5_CH0SIG
 * @{
 */
#define PCNT5_CH0SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
#define PCNT5_CH0SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH0_IN5, ESP_NOSIG)
/** @} */

/**
 * @name PCNT5_CH1CTRL
 * @{
 */
#define PCNT5_CH1CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH1_IN5, ESP_NOSIG)
/** @} */

/**
 * @name PCNT5_CH1SIG
 * @{
 */
#define PCNT5_CH1SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
#define PCNT5_CH1SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH1_IN5, ESP_NOSIG)
/** @} */

/**
 * @name PCNT6_CH0CTRL
 * @{
 */
#define PCNT6_CH0CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH0_IN6, ESP_NOSIG)
/** @} */

/**
 * @name PCNT6_CH0SIG
 * @{
 */
#define PCNT6_CH0SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
#define PCNT6_CH0SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH0_IN6, ESP_NOSIG)
/** @} */

/**
 * @name PCNT6_CH1CTRL
 * @{
 */
#define PCNT6_CH1CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH1_IN6, ESP_NOSIG)
/** @} */

/**
 * @name PCNT6_CH1SIG
 * @{
 */
#define PCNT6_CH1SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
#define PCNT6_CH1SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH1_IN6, ESP_NOSIG)
/** @} */

