zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32-pinctrl.h
/**
 * @name PCNT7_CH0CTRL
 * @{
 */
#define PCNT7_CH0CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH0_IN7, ESP_NOSIG)
/** @} */

/**
 * @name PCNT7_CH0SIG
 * @{
 */
#define PCNT7_CH0SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
#define PCNT7_CH0SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH0_IN7, ESP_NOSIG)
/** @} */

/**
 * @name PCNT7_CH1CTRL
 * @{
 */
#define PCNT7_CH1CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT_CTRL_CH1_IN7, ESP_NOSIG)
/** @} */

/**
 * @name PCNT7_CH1SIG
 * @{
 */
#define PCNT7_CH1SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
#define PCNT7_CH1SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT_SIG_CH1_IN7, ESP_NOSIG)
/** @} */

/**
 * @name RMII_CLK
 * @{
 */
#define RMII_CLK_GPIO0 ESP32_RMII_PINMUX(0, ESP_RMII_CLK)
/** @} */

/**
 * @name RMII_CRS_DV
 * @{
 */
#define RMII_CRS_DV_GPIO27 ESP32_RMII_PINMUX(27, ESP_RMII_CRS_DV)
/** @} */

/**
 * @name RMII_RXD0
 * @{
 */
#define RMII_RXD0_GPIO25 ESP32_RMII_PINMUX(25, ESP_RMII_RXD0)
/** @} */

/**
 * @name RMII_RXD1
 * @{
 */
#define RMII_RXD1_GPIO26 ESP32_RMII_PINMUX(26, ESP_RMII_RXD1)
/** @} */

/**
 * @name RMII_TX_EN
 * @{
 */
#define RMII_TX_EN_GPIO21 ESP32_RMII_PINMUX(21, ESP_RMII_TX_EN)
/** @} */

/**
 * @name RMII_TXD0
 * @{
 */
#define RMII_TXD0_GPIO19 ESP32_RMII_PINMUX(19, ESP_RMII_TXD0)
/** @} */

/**
 * @name RMII_TXD1
 * @{
 */
#define RMII_TXD1_GPIO22 ESP32_RMII_PINMUX(22, ESP_RMII_TXD1)
/** @} */

/**
 * @name SDHC0_CD
 * @{
 */
#define SDHC0_CD_GPIO5 ESP32_PINMUX(5, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO6 ESP32_PINMUX(6, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO7 ESP32_PINMUX(7, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO8 ESP32_PINMUX(8, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO9 ESP32_PINMUX(9, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO10 ESP32_PINMUX(10, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO11 ESP32_PINMUX(11, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO16 ESP32_PINMUX(16, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO17 ESP32_PINMUX(17, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO18 ESP32_PINMUX(18, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO19 ESP32_PINMUX(19, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO20 ESP32_PINMUX(20, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO21 ESP32_PINMUX(21, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO22 ESP32_PINMUX(22, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO23 ESP32_PINMUX(23, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO25 ESP32_PINMUX(25, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO26 ESP32_PINMUX(26, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO27 ESP32_PINMUX(27, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO32 ESP32_PINMUX(32, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO33 ESP32_PINMUX(33, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO34 ESP32_PINMUX(34, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO35 ESP32_PINMUX(35, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO36 ESP32_PINMUX(36, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO37 ESP32_PINMUX(37, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO38 ESP32_PINMUX(38, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
#define SDHC0_CD_GPIO39 ESP32_PINMUX(39, ESP_HOST_CARD_DETECT_N_2, ESP_NOSIG)
/** @} */

/**
 * @name SDHC0_WP
 * @{
 */
#define SDHC0_WP_GPIO5 ESP32_PINMUX(5, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO6 ESP32_PINMUX(6, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO7 ESP32_PINMUX(7, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO8 ESP32_PINMUX(8, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO9 ESP32_PINMUX(9, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO10 ESP32_PINMUX(10, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO11 ESP32_PINMUX(11, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO16 ESP32_PINMUX(16, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO17 ESP32_PINMUX(17, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO18 ESP32_PINMUX(18, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO19 ESP32_PINMUX(19, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO20 ESP32_PINMUX(20, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO21 ESP32_PINMUX(21, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO22 ESP32_PINMUX(22, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO23 ESP32_PINMUX(23, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO25 ESP32_PINMUX(25, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO26 ESP32_PINMUX(26, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO27 ESP32_PINMUX(27, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO32 ESP32_PINMUX(32, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO33 ESP32_PINMUX(33, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO34 ESP32_PINMUX(34, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO35 ESP32_PINMUX(35, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO36 ESP32_PINMUX(36, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO37 ESP32_PINMUX(37, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO38 ESP32_PINMUX(38, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
#define SDHC0_WP_GPIO39 ESP32_PINMUX(39, ESP_HOST_CARD_WRITE_PRT_2, ESP_NOSIG)
/** @} */

/**
 * @name SMI_MDC
 * @{
 */
#define SMI_MDC_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_EMAC_MDC_O)
#define SMI_MDC_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_EMAC_MDC_O)
/** @} */

/**
 * @name SMI_MDIO
 * @{
 */
#define SMI_MDIO_GPIO0 ESP32_PINMUX(0, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO1 ESP32_PINMUX(1, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO2 ESP32_PINMUX(2, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO3 ESP32_PINMUX(3, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO4 ESP32_PINMUX(4, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO5 ESP32_PINMUX(5, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO6 ESP32_PINMUX(6, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO7 ESP32_PINMUX(7, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO8 ESP32_PINMUX(8, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO9 ESP32_PINMUX(9, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO10 ESP32_PINMUX(10, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO11 ESP32_PINMUX(11, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO12 ESP32_PINMUX(12, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO13 ESP32_PINMUX(13, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO14 ESP32_PINMUX(14, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO15 ESP32_PINMUX(15, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO16 ESP32_PINMUX(16, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO17 ESP32_PINMUX(17, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO18 ESP32_PINMUX(18, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO19 ESP32_PINMUX(19, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO20 ESP32_PINMUX(20, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO21 ESP32_PINMUX(21, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO22 ESP32_PINMUX(22, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO23 ESP32_PINMUX(23, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO25 ESP32_PINMUX(25, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO26 ESP32_PINMUX(26, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO27 ESP32_PINMUX(27, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO32 ESP32_PINMUX(32, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
#define SMI_MDIO_GPIO33 ESP32_PINMUX(33, ESP_EMAC_MDI_I, ESP_EMAC_MDO_O)
/** @} */

/**
 * @name SPIM2_CSEL
 * @{
 */
#define SPIM2_CSEL_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_HSPICS0_OUT)
#define SPIM2_CSEL_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_HSPICS0_OUT)
/** @} */

