zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32-pinctrl.h
/**
 * @name SPIM2_CSEL1
 * @{
 */
#define SPIM2_CSEL1_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_HSPICS1_OUT)
#define SPIM2_CSEL1_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_HSPICS1_OUT)
/** @} */

/**
 * @name SPIM2_CSEL2
 * @{
 */
#define SPIM2_CSEL2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_HSPICS2_OUT)
#define SPIM2_CSEL2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_HSPICS2_OUT)
/** @} */

/**
 * @name SPIM2_MISO
 * @{
 */
#define SPIM2_MISO_GPIO0 ESP32_PINMUX(0, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO1 ESP32_PINMUX(1, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO2 ESP32_PINMUX(2, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO3 ESP32_PINMUX(3, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO4 ESP32_PINMUX(4, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO5 ESP32_PINMUX(5, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO6 ESP32_PINMUX(6, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO7 ESP32_PINMUX(7, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO8 ESP32_PINMUX(8, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO9 ESP32_PINMUX(9, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO10 ESP32_PINMUX(10, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO11 ESP32_PINMUX(11, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO12 ESP32_PINMUX(12, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO13 ESP32_PINMUX(13, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO14 ESP32_PINMUX(14, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO15 ESP32_PINMUX(15, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO16 ESP32_PINMUX(16, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO17 ESP32_PINMUX(17, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO18 ESP32_PINMUX(18, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO19 ESP32_PINMUX(19, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO20 ESP32_PINMUX(20, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO21 ESP32_PINMUX(21, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO22 ESP32_PINMUX(22, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO23 ESP32_PINMUX(23, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO25 ESP32_PINMUX(25, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO26 ESP32_PINMUX(26, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO27 ESP32_PINMUX(27, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO32 ESP32_PINMUX(32, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO33 ESP32_PINMUX(33, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO34 ESP32_PINMUX(34, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO35 ESP32_PINMUX(35, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO36 ESP32_PINMUX(36, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO37 ESP32_PINMUX(37, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO38 ESP32_PINMUX(38, ESP_HSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO39 ESP32_PINMUX(39, ESP_HSPIQ_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIM2_MOSI
 * @{
 */
#define SPIM2_MOSI_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_HSPID_OUT)
#define SPIM2_MOSI_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_HSPID_OUT)
/** @} */

/**
 * @name SPIM2_SCLK
 * @{
 */
#define SPIM2_SCLK_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_HSPICLK_OUT)
#define SPIM2_SCLK_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_HSPICLK_OUT)
/** @} */

/**
 * @name SPIM3_CSEL
 * @{
 */
#define SPIM3_CSEL_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_VSPICS0_OUT)
#define SPIM3_CSEL_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_VSPICS0_OUT)
/** @} */

/**
 * @name SPIM3_CSEL1
 * @{
 */
#define SPIM3_CSEL1_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_VSPICS1_OUT)
#define SPIM3_CSEL1_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_VSPICS1_OUT)
/** @} */

/**
 * @name SPIM3_CSEL2
 * @{
 */
#define SPIM3_CSEL2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_VSPICS2_OUT)
#define SPIM3_CSEL2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_VSPICS2_OUT)
/** @} */

/**
 * @name SPIM3_MISO
 * @{
 */
#define SPIM3_MISO_GPIO0 ESP32_PINMUX(0, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO1 ESP32_PINMUX(1, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO2 ESP32_PINMUX(2, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO3 ESP32_PINMUX(3, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO4 ESP32_PINMUX(4, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO5 ESP32_PINMUX(5, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO6 ESP32_PINMUX(6, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO7 ESP32_PINMUX(7, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO8 ESP32_PINMUX(8, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO9 ESP32_PINMUX(9, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO10 ESP32_PINMUX(10, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO11 ESP32_PINMUX(11, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO12 ESP32_PINMUX(12, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO13 ESP32_PINMUX(13, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO14 ESP32_PINMUX(14, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO15 ESP32_PINMUX(15, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO16 ESP32_PINMUX(16, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO17 ESP32_PINMUX(17, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO18 ESP32_PINMUX(18, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO19 ESP32_PINMUX(19, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO20 ESP32_PINMUX(20, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO21 ESP32_PINMUX(21, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO22 ESP32_PINMUX(22, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO23 ESP32_PINMUX(23, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO25 ESP32_PINMUX(25, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO26 ESP32_PINMUX(26, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO27 ESP32_PINMUX(27, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO32 ESP32_PINMUX(32, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO33 ESP32_PINMUX(33, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO34 ESP32_PINMUX(34, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO35 ESP32_PINMUX(35, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO36 ESP32_PINMUX(36, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO37 ESP32_PINMUX(37, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO38 ESP32_PINMUX(38, ESP_VSPIQ_IN, ESP_NOSIG)
#define SPIM3_MISO_GPIO39 ESP32_PINMUX(39, ESP_VSPIQ_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIM3_MOSI
 * @{
 */
#define SPIM3_MOSI_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_VSPID_OUT)
#define SPIM3_MOSI_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_VSPID_OUT)
/** @} */

/**
 * @name SPIM3_SCLK
 * @{
 */
#define SPIM3_SCLK_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_VSPICLK_OUT)
#define SPIM3_SCLK_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_VSPICLK_OUT)
/** @} */

