zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32-pinctrl.h
/**
 * @name SPIS2_CSEL
 * @{
 */
#define SPIS2_CSEL_GPIO0  ESP32_PINMUX(0, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO1  ESP32_PINMUX(1, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO2  ESP32_PINMUX(2, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO3  ESP32_PINMUX(3, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO4  ESP32_PINMUX(4, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO5  ESP32_PINMUX(5, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO6  ESP32_PINMUX(6, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO7  ESP32_PINMUX(7, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO8  ESP32_PINMUX(8, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO9  ESP32_PINMUX(9, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO22 ESP32_PINMUX(22, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO23 ESP32_PINMUX(23, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO25 ESP32_PINMUX(25, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO32 ESP32_PINMUX(32, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO33 ESP32_PINMUX(33, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO34 ESP32_PINMUX(34, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO35 ESP32_PINMUX(35, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO36 ESP32_PINMUX(36, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO37 ESP32_PINMUX(37, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO38 ESP32_PINMUX(38, ESP_HSPICS0_IN, ESP_NOSIG)
#define SPIS2_CSEL_GPIO39 ESP32_PINMUX(39, ESP_HSPICS0_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_MISO
 * @{
 */
#define SPIS2_MISO_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_HSPIQ_OUT)
#define SPIS2_MISO_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_HSPIQ_OUT)
/** @} */

/**
 * @name SPIS2_MOSI
 * @{
 */
#define SPIS2_MOSI_GPIO0  ESP32_PINMUX(0, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO1  ESP32_PINMUX(1, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO2  ESP32_PINMUX(2, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO3  ESP32_PINMUX(3, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO4  ESP32_PINMUX(4, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO5  ESP32_PINMUX(5, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO6  ESP32_PINMUX(6, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO7  ESP32_PINMUX(7, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO8  ESP32_PINMUX(8, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO9  ESP32_PINMUX(9, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO10 ESP32_PINMUX(10, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO11 ESP32_PINMUX(11, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO12 ESP32_PINMUX(12, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO13 ESP32_PINMUX(13, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO14 ESP32_PINMUX(14, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO15 ESP32_PINMUX(15, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO16 ESP32_PINMUX(16, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO17 ESP32_PINMUX(17, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO18 ESP32_PINMUX(18, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO19 ESP32_PINMUX(19, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO20 ESP32_PINMUX(20, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO21 ESP32_PINMUX(21, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO22 ESP32_PINMUX(22, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO23 ESP32_PINMUX(23, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO25 ESP32_PINMUX(25, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO26 ESP32_PINMUX(26, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO27 ESP32_PINMUX(27, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO32 ESP32_PINMUX(32, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO33 ESP32_PINMUX(33, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO34 ESP32_PINMUX(34, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO35 ESP32_PINMUX(35, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO36 ESP32_PINMUX(36, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO37 ESP32_PINMUX(37, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO38 ESP32_PINMUX(38, ESP_HSPID_IN, ESP_NOSIG)
#define SPIS2_MOSI_GPIO39 ESP32_PINMUX(39, ESP_HSPID_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS2_SCLK
 * @{
 */
#define SPIS2_SCLK_GPIO0  ESP32_PINMUX(0, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO1  ESP32_PINMUX(1, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO2  ESP32_PINMUX(2, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO3  ESP32_PINMUX(3, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO4  ESP32_PINMUX(4, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO5  ESP32_PINMUX(5, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO6  ESP32_PINMUX(6, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO7  ESP32_PINMUX(7, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO8  ESP32_PINMUX(8, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO9  ESP32_PINMUX(9, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO15 ESP32_PINMUX(15, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO16 ESP32_PINMUX(16, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO17 ESP32_PINMUX(17, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO18 ESP32_PINMUX(18, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO19 ESP32_PINMUX(19, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO20 ESP32_PINMUX(20, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO21 ESP32_PINMUX(21, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO32 ESP32_PINMUX(32, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO33 ESP32_PINMUX(33, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO34 ESP32_PINMUX(34, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO35 ESP32_PINMUX(35, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO36 ESP32_PINMUX(36, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO37 ESP32_PINMUX(37, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO38 ESP32_PINMUX(38, ESP_HSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO39 ESP32_PINMUX(39, ESP_HSPICLK_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS3_CSEL
 * @{
 */
#define SPIS3_CSEL_GPIO0  ESP32_PINMUX(0, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO1  ESP32_PINMUX(1, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO2  ESP32_PINMUX(2, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO3  ESP32_PINMUX(3, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO4  ESP32_PINMUX(4, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO5  ESP32_PINMUX(5, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO6  ESP32_PINMUX(6, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO7  ESP32_PINMUX(7, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO8  ESP32_PINMUX(8, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO9  ESP32_PINMUX(9, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO10 ESP32_PINMUX(10, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO11 ESP32_PINMUX(11, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO12 ESP32_PINMUX(12, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO13 ESP32_PINMUX(13, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO14 ESP32_PINMUX(14, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO15 ESP32_PINMUX(15, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO16 ESP32_PINMUX(16, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO17 ESP32_PINMUX(17, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO18 ESP32_PINMUX(18, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO19 ESP32_PINMUX(19, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO20 ESP32_PINMUX(20, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO21 ESP32_PINMUX(21, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO22 ESP32_PINMUX(22, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO23 ESP32_PINMUX(23, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO25 ESP32_PINMUX(25, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO26 ESP32_PINMUX(26, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO27 ESP32_PINMUX(27, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO32 ESP32_PINMUX(32, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO33 ESP32_PINMUX(33, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO34 ESP32_PINMUX(34, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO35 ESP32_PINMUX(35, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO36 ESP32_PINMUX(36, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO37 ESP32_PINMUX(37, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO38 ESP32_PINMUX(38, ESP_VSPICS0_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO39 ESP32_PINMUX(39, ESP_VSPICS0_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS3_MISO
 * @{
 */
#define SPIS3_MISO_GPIO0  ESP32_PINMUX(0, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO1  ESP32_PINMUX(1, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO2  ESP32_PINMUX(2, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO3  ESP32_PINMUX(3, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO4  ESP32_PINMUX(4, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO5  ESP32_PINMUX(5, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO6  ESP32_PINMUX(6, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO7  ESP32_PINMUX(7, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO8  ESP32_PINMUX(8, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO9  ESP32_PINMUX(9, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_VSPIQ_OUT)
#define SPIS3_MISO_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_VSPIQ_OUT)
/** @} */

/**
 * @name SPIS3_MOSI
 * @{
 */
#define SPIS3_MOSI_GPIO0  ESP32_PINMUX(0, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO1  ESP32_PINMUX(1, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO2  ESP32_PINMUX(2, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO3  ESP32_PINMUX(3, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO4  ESP32_PINMUX(4, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO5  ESP32_PINMUX(5, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO6  ESP32_PINMUX(6, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO7  ESP32_PINMUX(7, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO8  ESP32_PINMUX(8, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO9  ESP32_PINMUX(9, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO10 ESP32_PINMUX(10, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO11 ESP32_PINMUX(11, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO12 ESP32_PINMUX(12, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO13 ESP32_PINMUX(13, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO14 ESP32_PINMUX(14, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO15 ESP32_PINMUX(15, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO16 ESP32_PINMUX(16, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO17 ESP32_PINMUX(17, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO18 ESP32_PINMUX(18, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO19 ESP32_PINMUX(19, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO20 ESP32_PINMUX(20, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO21 ESP32_PINMUX(21, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO22 ESP32_PINMUX(22, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO23 ESP32_PINMUX(23, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO25 ESP32_PINMUX(25, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO26 ESP32_PINMUX(26, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO27 ESP32_PINMUX(27, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO32 ESP32_PINMUX(32, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO33 ESP32_PINMUX(33, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO34 ESP32_PINMUX(34, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO35 ESP32_PINMUX(35, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO36 ESP32_PINMUX(36, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO37 ESP32_PINMUX(37, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO38 ESP32_PINMUX(38, ESP_VSPID_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO39 ESP32_PINMUX(39, ESP_VSPID_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS3_SCLK
 * @{
 */
#define SPIS3_SCLK_GPIO0  ESP32_PINMUX(0, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO1  ESP32_PINMUX(1, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO2  ESP32_PINMUX(2, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO3  ESP32_PINMUX(3, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO4  ESP32_PINMUX(4, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO5  ESP32_PINMUX(5, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO6  ESP32_PINMUX(6, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO7  ESP32_PINMUX(7, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO8  ESP32_PINMUX(8, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO9  ESP32_PINMUX(9, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO10 ESP32_PINMUX(10, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO11 ESP32_PINMUX(11, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO12 ESP32_PINMUX(12, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO13 ESP32_PINMUX(13, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO14 ESP32_PINMUX(14, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO15 ESP32_PINMUX(15, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO16 ESP32_PINMUX(16, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO17 ESP32_PINMUX(17, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO18 ESP32_PINMUX(18, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO19 ESP32_PINMUX(19, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO20 ESP32_PINMUX(20, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO21 ESP32_PINMUX(21, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO22 ESP32_PINMUX(22, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO23 ESP32_PINMUX(23, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO25 ESP32_PINMUX(25, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO26 ESP32_PINMUX(26, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO27 ESP32_PINMUX(27, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO32 ESP32_PINMUX(32, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO33 ESP32_PINMUX(33, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO34 ESP32_PINMUX(34, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO35 ESP32_PINMUX(35, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO36 ESP32_PINMUX(36, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO37 ESP32_PINMUX(37, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO38 ESP32_PINMUX(38, ESP_VSPICLK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO39 ESP32_PINMUX(39, ESP_VSPICLK_IN, ESP_NOSIG)
/** @} */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESP32_PINCTRL_H_ */
